kipperjjang/Capstone_design_team3/STM32_codesave/capstone_motordriver/Core/Src/main.c
#define POS_CTRL_HZ       (20000.0f)
#define POS_CTRL_DT       (1.0f / POS_CTRL_HZ)

float th_m       = 0.0f;   // mechanical angle, wrapped [-pi, pi)
float th_m_cont  = 0.0f;   // continuous mechanical angle [rad]
float w_m        = 0.0f;   // filtered mechanical speed [rad/s]
float w_m_raw    = 0.0f;   // raw mechanical speed [rad/s]

float th_m_prev    = 0.0f;
uint8_t th_m_init  = 0U;

volatile uint8_t can_cmd = 0;
volatile uint8_t can_cmd_seq = 0;
volatile uint8_t can_last_cmd_seq = 0;
volatile uint8_t can_cmd_seq_valid = 0;
volatile uint32_t can_rx_count = 0;
volatile uint32_t can_tx_count = 0;
volatile uint32_t can_tx_fail_count = 0;
volatile uint32_t last_can_cmd_tick = 0;
volatile float can_target_pos = 0.0f;
volatile float can_target_vel = 0.0f;
volatile uint8_t motor_error_code = MOTOR_ERR_NONE;

uint8_t not_aim = 1;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_FDCAN2_Init(void);
static void MX_TIM1_Init(void);
static void MX_SPI1_Init(void);
static void MX_ADC2_Init(void);
static void MX_ADC3_Init(void);
static void MX_SPI3_Init(void);
static void MX_ADC1_Init(void);
static void MX_CORDIC_Init(void);
/* USER CODE BEGIN PFP */

// Forward declarations
static inline uint32_t dwt_now(void);
static inline float cycles_to_us(uint32_t cyc);
static inline float wrap_pm_pi(float x);
static inline float clampf(float x, float lo, float hi);
static inline uint16_t clamp_u16_i32(int32_t x, uint16_t lo, uint16_t hi);
static inline int8_t sign_hyst(float x, float eps);
static inline int8_t sign_hold(float x, float eps, int8_t *last);
int __io_putchar(int ch);
static inline void DWT_Init(void);
void set_ccr(uint16_t a, uint16_t b, uint16_t c);
static inline void CORDIC_Init_Phase(void);
static inline int32_t float_to_q31(float x);
static inline float cordic_atan2_rad(float y, float x);
static inline float sat(float x);

void SVPWM(float, float);

static inline float AS5048_CountToMechRad(uint16_t cnt);
static inline void MechAngleSpeed_Update(void);

static inline int16_t clamp_i16_from_float(float x);
static inline int32_t get_i32_le(uint8_t *d);
static inline int16_t get_i16_le(uint8_t *d);
static inline void put_i16_le(uint8_t *d, int16_t v);

static void Motor_SendStatus(uint8_t seq);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

static inline void PositionPID_Update(void)
{
    pos_ref_mech_rad = clampf(pos_ref_mech_rad, -mech_limit, mech_limit);

    if (not_aim) {
        iq_ref = 0.0f;
        id_ref = 0.0f;

        pos_err = 0.0f;
        pos_err_integral = 0.0f;

        P_part = 0.0f;
        I_part = 0.0f;
        D_part = 0.0f;

        return;
    }

    pos_err = pos_ref_mech_rad - th_m_cont;

    P_part = pos_P * pos_err;
    D_part = -pos_D * w_m;

    if (pos_I > 1e-6f) {
        if (fabsf(pos_err) < POS_I_ENABLE_ERR) {
            pos_err_integral += pos_err * POS_CTRL_DT;
        }

        float pos_err_integral_LIMIT = POS_I_LIMIT_RATE * (IQ_REF_LIMIT / pos_I);

        pos_err_integral = clampf(pos_err_integral,
                                  -pos_err_integral_LIMIT,
                                   pos_err_integral_LIMIT);

        I_part = pos_I * pos_err_integral;
    }
    else {
        pos_err_integral = 0.0f;
        I_part = 0.0f;
    }

    float u_unsat = P_part + I_part + D_part;
    float u_sat = clampf(u_unsat, -IQ_REF_LIMIT, IQ_REF_LIMIT);

    iq_ref = u_sat;
    id_ref = 0.0f;
}

uint32_t debug_time_start, SVPWM_end;

#define measure_limit (V_BUS * 2)  //atan2 limit. change for max voltage or max current
#define current_const (0.00805664f*2)  // 10V/V Op-amp gain
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim){  //TIM interrupt rank has to be added in main()
	if(htim->Instance == TIM1){
		debug_time_start = dwt_now();

		AS5048A_ReadAngle();

		float delta = (float) (mech_angle - AS5048_zeropos);
		if(delta < 0.0) delta = delta + 16384.0;
		while(delta > ELEC_CNT){
			delta = delta - ELEC_CNT;
		}
		electrical_angle = delta * 360.0f / ELEC_CNT;

		if (electrical_angle > 180.0f) electrical_angle -= 360.0f;

		arm_sin_cos_f32(electrical_angle,&_sin,&_cos);

		MechAngleSpeed_Update();
		PositionPID_Update();

		// alpha beta current calculation
		ic = current_A[0] - current_A_calibrated;  // A<->C mapping hardware issue
		ib = current_B[0] - current_B_calibrated;
		//ia = current_C[0] - current_C_calibrated;  // A<->C mapping hardware issue
		ia = -(ib+ic); // ia is very unstable. currnet_C has big jitter (+-10 LSB) (maybe hardware PCB problem. maybe charge pump?)

		// inv clarke
		i_alpha = ia * current_const;                   // i_alpha = 2/3 * (ia - (ib + ic)/2) = ia
		i_beta  = (ib - ic) * invsqrt3 * current_const; // i_beta  = 2/3 * (ib - ic) * sqrt(3)/2 = (ib - ic) * 1/sqrt(3)


		if(encoder_cali){
			V_arg = V_arg + V_cali_speed;

			if(V_arg > 180.0f)
				V_arg -= 360.0f;
			else if(V_arg < -180.0f)
				V_arg += 360.0f;

			arm_sin_cos_f32(V_arg,&cali_sin,&cali_cos);

			SVPWM(V_mag * cali_cos, V_mag * cali_sin);
			return;
		}

		// inv park, using high frequency rejected
		id =  i_alpha * _cos + i_beta * _sin;
		iq = -i_alpha * _sin + i_beta * _cos;

		//PI
		iq_err = iq_ref - iq;
		id_err = id_ref - id;
		iq_err_integral = iq_err_integral + iq_err;
		id_err_integral = id_err_integral + id_err;

		// Vq, Vd calculation
		float Vq_unsat = (P * iq_err) + (I * iq_err_integral);
		float Vd_unsat = (P * id_err) + (I * id_err_integral);

		Vd = (Vd_unsat > Vd_limit) ? Vd_limit : (Vd_unsat < -Vd_limit) ? -Vd_limit : Vd_unsat;

		float Vq_limit;
		arm_sqrt_f32((V_LIMIT*V_LIMIT) - (Vd*Vd), &Vq_limit);
		Vq = (Vq_unsat > Vq_limit) ? Vq_limit : (Vq_unsat < -Vq_limit) ? -Vq_limit : Vq_unsat;

