kipperjjang/Capstone_design_team3/STM32_codesave/capstone_motordriver/Core/Src/main.c
		iq_err_integral = iq_err_integral - Ka*(Vq_unsat - Vq);
		id_err_integral = id_err_integral - Ka*(Vd_unsat - Vd);

		// park
		V_alpha = Vd * _cos - Vq * _sin;
		V_beta  = Vd * _sin + Vq * _cos;

		SVPWM(V_alpha, V_beta);

		SVPWM_end = dwt_now();

		/*if(current_log){
			if(i++ < 10000){
				current_log_1[i] = iq_ref;
				current_log_2[i] = iq;
			}
		}

		if(flip++ == 49999){
			iq_ref = -iq_ref;
			flip = 0;
		}*/

		all_us               = cycles_to_us(SVPWM_end - debug_time_start);

	}
	return;
}




/* CAN Rx ISR start */
void HAL_FDCAN_RxFifo0Callback(FDCAN_HandleTypeDef *hfdcan, uint32_t RxFifo0ITs)
{
    if (hfdcan->Instance != FDCAN2)
        return;

    if ((RxFifo0ITs & FDCAN_IT_RX_FIFO0_NEW_MESSAGE) == 0)
        return;

    CAN_receive_status =
        (HAL_FDCAN_GetRxMessage(hfdcan, FDCAN_RX_FIFO0, &Rx_Header, Rx_Data) == HAL_OK);

    if (!CAN_receive_status)
        return;

    CAN_receive_status = 0;
    can_rx_count++;

    HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_3);  // green LED

    // 내 command ID가 아니면 무시
    if (Rx_Header.Identifier != CAN_ID_CMD)
        return;

    // Classic CAN 8 byte만 허용
    if (Rx_Header.DataLength != FDCAN_DLC_BYTES_8)
        return;

    int32_t pos_q = get_i32_le(&Rx_Data[0]);

    /*uint8_t P_q = Rx_Data[4];
    uint8_t D_q = Rx_Data[5];

    pos_P = ((float)P_q / 255.0f) * 100.0f;
    pos_D = ((float)D_q / 255.0f) * 10.0f;

    if(pos_P > 100.0f) pos_P = 100.0f;
    if(pos_P < 0.0f)  pos_P = 0.0f;

    if(pos_D > 10.0f) pos_D = 10.0f;
    if(pos_D < 0.0f) pos_D = 0.0f;*/

    uint8_t cmd = Rx_Data[6];
    uint8_t seq = Rx_Data[7];

    can_target_pos = ((float)pos_q) / CAN_CMD_POS_SCALE;

    can_cmd = cmd;
    can_cmd_seq = seq;
    last_can_cmd_tick = HAL_GetTick();

    if (can_cmd_seq_valid)
    {
        uint8_t expected = can_last_cmd_seq + 1;

        // 일단 에러로 막지는 않고 디버깅용으로만 사용
        if (seq != expected)
        {
            // 필요하면 별도 seq error bit 추가 가능
        }
    }
    else
    {
        can_cmd_seq_valid = 1;
    }

    can_last_cmd_seq = seq;

    if (cmd & CMD_AIM)
    {
        float ref = can_target_pos;

        if (ref > mech_limit)
        {
            ref = mech_limit;
            motor_error_code |= MOTOR_ERR_LIMIT;
        }
        else if (ref < -mech_limit)
        {
            ref = -mech_limit;
            motor_error_code |= MOTOR_ERR_LIMIT;
        }
        else
        {
            motor_error_code &= ~MOTOR_ERR_LIMIT;
        }

        pos_ref_mech_rad = ref;
        not_aim = 0;
    }
    else
    	not_aim = 1;

    if (DRV8353_status != 0xFF)
        motor_error_code |= MOTOR_ERR_DRV;
    else
        motor_error_code &= ~MOTOR_ERR_DRV;

    Motor_SendStatus(seq);
}
/* CAN Rx ISR end */


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_FDCAN2_Init();
  MX_TIM1_Init();
  MX_SPI1_Init();
  MX_ADC2_Init();
  MX_ADC3_Init();
  MX_SPI3_Init();
  MX_ADC1_Init();
  MX_CORDIC_Init();
  /* USER CODE BEGIN 2 */

  DWT_Init();
  CORDIC_Init_Phase();

  // ADC calibration
  ADC_cali_status |= (HAL_ADCEx_Calibration_Start(&hadc1, ADC_SINGLE_ENDED) == HAL_OK) << 2;
  ADC_cali_status |= (HAL_ADCEx_Calibration_Start(&hadc2, ADC_SINGLE_ENDED) == HAL_OK) << 1;
  ADC_cali_status |= (HAL_ADCEx_Calibration_Start(&hadc3, ADC_SINGLE_ENDED) == HAL_OK);

  // TIM 1 start
  PWM_ADC_status |= (HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1) == HAL_OK) << 7;
  PWM_ADC_status |= (HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2) == HAL_OK) << 6;
  PWM_ADC_status |= (HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_3) == HAL_OK) << 5;
  TIM1->CCR1 = ARR_TICKS;
  TIM1->CCR2 = ARR_TICKS;
  TIM1->CCR3 = ARR_TICKS;


  // CAN filter
  sFilter.IdType       = FDCAN_STANDARD_ID;
  sFilter.FilterIndex  = 0;
  sFilter.FilterType   = FDCAN_FILTER_MASK;
  sFilter.FilterConfig = FDCAN_FILTER_TO_RXFIFO0;
  sFilter.FilterID1    = CAN_ID_CMD;   // 0x100 + NODE_ID
  sFilter.FilterID2    = 0x7FF;        // 11-bit exact match mask

  CAN_setting_status |= (HAL_FDCAN_ConfigFilter(&hfdcan2, &sFilter) == HAL_OK)                                                               << 7;
  CAN_setting_status |= (HAL_FDCAN_ConfigGlobalFilter(&hfdcan2,FDCAN_REJECT,FDCAN_REJECT,FDCAN_REJECT_REMOTE,FDCAN_REJECT_REMOTE) == HAL_OK) << 6;
  CAN_setting_status |= (HAL_FDCAN_ActivateNotification(&hfdcan2,FDCAN_IT_RX_FIFO0_NEW_MESSAGE,0) == HAL_OK)                                 << 5;
  CAN_setting_status |= (HAL_FDCAN_Start(&hfdcan2) == HAL_OK)                                                                                << 4;

  Tx_Header.Identifier          = CAN_ID_STATUS;       // 0x180 + NODE_ID
  Tx_Header.IdType              = FDCAN_STANDARD_ID;
  Tx_Header.TxFrameType         = FDCAN_DATA_FRAME;
  Tx_Header.DataLength          = FDCAN_DLC_BYTES_8;
  Tx_Header.ErrorStateIndicator = FDCAN_ESI_ACTIVE;
  Tx_Header.BitRateSwitch       = FDCAN_BRS_OFF;
  Tx_Header.FDFormat            = FDCAN_CLASSIC_CAN;
  Tx_Header.TxEventFifoControl  = FDCAN_NO_TX_EVENTS;
  Tx_Header.MessageMarker       = 0;


  HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_6);  // blue LED
  HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_3);  // green LED
  HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_15); // red LED

  HAL_Delay(500);

  HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_6);  // blue LED
  HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_3);  // green LED
  HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_15); // red LED


  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_4, 1);  // AS5048 nCS HIGH
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_14, 1); // DRV8353 enable
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_10, 1); // DRV8353 nCS HIGH
  HAL_Delay(10);

  DRV8353_errorflag_reset();
  DRV8353_SPI_read();
  DRV8353_SPI_setting();
  DRV8353_SPI_read();
  DRV8353_status = DRV8353_issetuped();

  // ADC 1,2,3 start
  PWM_ADC_status |= (HAL_ADC_Start_DMA(&hadc1, (uint32_t*)current_A, 1) == HAL_OK) << 3;
  PWM_ADC_status |= (HAL_ADC_Start_DMA(&hadc2, (uint32_t*)current_B, 1) == HAL_OK) << 2;
  PWM_ADC_status |= (HAL_ADC_Start_DMA(&hadc3, (uint32_t*)current_C, 1) == HAL_OK) << 1;

