kipperjjang/Capstone_design_team3/STM32_codesave/capstone_motordriver/Core/Src/main.c
    // 사이클 카운터 enable
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
}

void set_ccr(uint16_t a, uint16_t b, uint16_t c){
    TIM1->CCR1 = a; TIM1->CCR2 = b; TIM1->CCR3 = c;
}

static inline void CORDIC_Init_Phase(void)
{
    LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_CORDIC);

    // PHASE(atan2) / 2 inputs / 1 output / 32-bit in/out / 적당한 precision
    LL_CORDIC_Config(CORDIC,
                     LL_CORDIC_FUNCTION_PHASE,
                     LL_CORDIC_PRECISION_6CYCLES,   // 필요시 4/6/8 cycles로 타협
                     LL_CORDIC_SCALE_0,
                     LL_CORDIC_NBWRITE_2,
                     LL_CORDIC_NBREAD_1,
                     LL_CORDIC_INSIZE_32BITS,
                     LL_CORDIC_OUTSIZE_32BITS);
}

static inline int32_t float_to_q31(float x)
{
    if (x >  0.999999f) x =  0.999999f;
    if (x < -1.0f)      x = -1.0f;
    return (int32_t)(x * 2147483648.0f); // 2^31
}

static inline float cordic_atan2_rad(float y, float x){
    // 0,0 예외
//    float ax = fabsf(x), ay = fabsf(y);
//    float m = (ax > ay) ? ax : ay;
//    if (m < 1e-12f) return 0.0f;

    float xn = x / measure_limit;
    float yn = y / measure_limit;

    int32_t Xq = float_to_q31(xn);
    int32_t Yq = float_to_q31(yn);

    // 입력 write (X, Y)
    LL_CORDIC_WriteData(CORDIC, (uint32_t)Xq);
    LL_CORDIC_WriteData(CORDIC, (uint32_t)Yq);

    // 결과 read (각도)
    int32_t ang_q = (int32_t)LL_CORDIC_ReadData(CORDIC);

    const float Q31_TO_RAD = PI;
    float ang = ((float)ang_q / 2147483648.0f) * Q31_TO_RAD;
    return ang;
}

static inline float sat(float x){
    return clampf(x, -1.0f, 1.0f);
}


static inline float AS5048_CountToMechRad(uint16_t cnt){
    int32_t dcnt = (int32_t)cnt - (int32_t)AS5048_mech_zeropos;

    if (dcnt < 0) {
        dcnt += 16384;
    }

    // 0 ~ 2pi
    float th = (float)dcnt * AS5048_TO_RAD;

    // -pi ~ pi
    if (th >= PI) {
        th -= 2.0f * PI;
    }

    return th;
}

static inline void MechAngleSpeed_Update(void){
    float th_now = AS5048_CountToMechRad((uint16_t)mech_angle);

    if (!th_m_init) {
        th_m       = th_now;
        th_m_prev  = th_now;
        th_m_cont  = th_now;
        w_m_raw    = 0.0f;
        w_m        = 0.0f;
        th_m_init  = 1U;
        return;
    }

    // encoder wrap 보정된 delta angle
    float dth = wrap_pm_pi(th_now - th_m_prev);

    th_m_prev = th_now;
    th_m      = th_now;

    // multi-turn continuous angle
    th_m_cont += dth;

    // mechanical angular velocity [rad/s]
    w_m_raw = dth * POS_CTRL_HZ;

    // 간단한 1차 LPF
    w_m += W_M_LPF_ALPHA * (w_m_raw - w_m);
}


static inline int16_t clamp_i16_from_float(float x)
{
    if (x > 32767.0f) return 32767;
    if (x < -32768.0f) return -32768;
    return (int16_t)x;
}

static inline int32_t get_i32_le(uint8_t *d)
{
    return (int32_t)((uint32_t)d[0]
                  | ((uint32_t)d[1] << 8)
                  | ((uint32_t)d[2] << 16)
                  | ((uint32_t)d[3] << 24));
}

static inline int16_t get_i16_le(uint8_t *d)
{
    return (int16_t)((uint16_t)d[0] | ((uint16_t)d[1] << 8));
}

static inline void put_i16_le(uint8_t *d, int16_t v)
{
    d[0] = (uint8_t)(v & 0xFF);
    d[1] = (uint8_t)((v >> 8) & 0xFF);
}

#define dt_ticks    	  (16.8f)
#define I_EPS             (0.05f)
#define SQRT3_BY_2        (0.8660254037844386f)
static int8_t sa_last=0, sb_last=0, sc_last=0;

void SVPWM(float Valpha, float Vbeta){
    float Vmag;
    arm_sqrt_f32(Valpha*Valpha + Vbeta*Vbeta, &Vmag);

    if (Vmag < 1e-6f) {
        set_ccr(ARR_TICKS - (uint16_t)(ARR_TICKS/2), ARR_TICKS - (uint16_t)(ARR_TICKS/2), ARR_TICKS - (uint16_t)(ARR_TICKS/2));
        return;
    }

    float M = 1.73205080f * (Vmag / V_BUS);
    if (M > 0.99f) M = 0.99f;

    float ang = cordic_atan2_rad(Vbeta, Valpha);
    if (ang < 0) ang += 6.2831853f;

    uint8_t k = (uint8_t)(ang / SECTOR_RAD);
    if (k >= 6) k = 0;

    float phi = ang - k*SECTOR_RAD;

    float T1 = M * arm_sin_f32(SECTOR_RAD - phi);
    float T2 = M * arm_sin_f32(phi);

    int32_t t1 = (int32_t)(ARR_TICKS * T1);
    int32_t t2 = (int32_t)(ARR_TICKS * T2);

    int32_t t0 = (ARR_TICKS - t1 - t2) >> 1;
    if (t0 < 0) t0 = 0;

    uint16_t Ua, Ub, Uc;
    switch (k){
        case 0: Ua=t1+t2+t0; Ub=t2+t0;     Uc=t0;            break;
        case 1: Ua=t1+t0;    Ub=t1+t2+t0;  Uc=t0;            break;
        case 2: Ua=t0;       Ub=t1+t2+t0;  Uc=t2+t0;         break;
        case 3: Ua=t0;       Ub=t1+t0;     Uc=t1+t2+t0;      break;
        case 4: Ua=t2+t0;    Ub=t0;        Uc=t1+t2+t0;      break;
        default:Ua=t1+t2+t0; Ub=t0;        Uc=t1+t0;         break;
    }

    // deadtime compensation
    float ia_deadtime = i_alpha;
    float ib_deadtime = -0.5f * i_alpha + SQRT3_BY_2 * i_beta;
    float ic_deadtime = -0.5f * i_alpha - SQRT3_BY_2 * i_beta;

    int8_t sa = sign_hold(ia_deadtime, I_EPS, &sa_last);
    int8_t sb = sign_hold(ib_deadtime, I_EPS, &sb_last);
    int8_t sc = sign_hold(ic_deadtime, I_EPS, &sc_last);
    int32_t duA = (int32_t) ((float)sa * dt_ticks);
    int32_t duB = (int32_t) ((float)sb * dt_ticks);
    int32_t duC = (int32_t) ((float)sc * dt_ticks);

    int32_t duM = (duA + duB + duC) / 3;
    duA -= duM; duB -= duM; duC -= duM;

    int32_t Ua_c = (int32_t)Ua + duA;
    int32_t Ub_c = (int32_t)Ub + duB;
    int32_t Uc_c = (int32_t)Uc + duC;

    int32_t minU = Ua_c;
    if (Ub_c < minU) minU = Ub_c;
    if (Uc_c < minU) minU = Uc_c;
    int32_t maxU = Ua_c;
    if (Ub_c > maxU) maxU = Ub_c;
    if (Uc_c > maxU) maxU = Uc_c;
    if (minU < 0) {
        Ua_c -= minU; Ub_c -= minU; Uc_c -= minU;
        maxU -= minU;
    }
    if (maxU > ARR_TICKS) {
        int32_t sh = maxU - ARR_TICKS;
        Ua_c -= sh; Ub_c -= sh; Uc_c -= sh;
    }
    Ua = clamp_u16_i32(Ua_c, 0, ARR_TICKS);
    Ub = clamp_u16_i32(Ub_c, 0, ARR_TICKS);
    Uc = clamp_u16_i32(Uc_c, 0, ARR_TICKS);
    set_ccr(ARR_TICKS - Ua, ARR_TICKS - Ub, ARR_TICKS - Uc);
}

