kipperjjang/Capstone_design_team3/STM32_codesave/capstone_motordriver/Core/Src/main.c
static void Motor_SendStatus(uint8_t seq){
    int16_t pos_q;
    int16_t vel_q;
    int16_t torque_q;

    pos_q = clamp_i16_from_float(th_m_cont * CAN_FB_POS_SCALE);
    vel_q = clamp_i16_from_float(w_m * CAN_FB_VEL_SCALE);

    // 여기서는 iq_ref를 torque 대신 임시로 보냄.
    // 실제 토크[Nm]를 보내려면 torque = Kt * iq 형태로 바꾸면 됨.
    torque_q = clamp_i16_from_float(iq * CAN_FB_TORQUE_SCALE);

    put_i16_le(&Tx_Data[0], pos_q);
    put_i16_le(&Tx_Data[2], vel_q);
    put_i16_le(&Tx_Data[4], torque_q);

    Tx_Data[6] = motor_error_code;
    Tx_Data[7] = seq;

    CAN_transmit_status =
        (HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan2, &Tx_Header, Tx_Data) == HAL_OK);

    if (CAN_transmit_status)
        can_tx_count++;
    else
        can_tx_fail_count++;
}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1){

  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
